html/kotlin/oo/alias.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>类型别名</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./object.html"> UP </a>
 |
 <a accesskey="H" href="./oo.html"> HOME </a>
</div><div id="content">
<h1 class="title">类型别名</h1>
<p>
类型别名为现有类型提供替代名称
</p>

<pre class="example">
  如果类型名称太长，可以另外引入较短的名称，并使用新的名称替代原类型名 
</pre>

<p>
它有助于缩短较长的 <span class="underline">泛型</span> 类型。 例如，通常缩减集合类型是很有吸引力的
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">NodeSet</span> = <span style="color: #98f5ff;">Set&lt;Network.Node&gt;</span>

<span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">FileTable&lt;K&gt;</span> = <span style="color: #98f5ff;">MutableMap&lt;K</span>, <span style="color: #98f5ff;">MutableList&lt;File&gt;&gt;</span>
</pre>
</div>

<p>
可以为 <span class="underline">函数</span> 类型 提供另外的别名：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">MyHandler</span> = (<span style="color: #98f5ff;">Int</span>, <span style="color: #98f5ff;">String</span>, <span style="color: #98f5ff;">Any</span>) -&gt; <span style="color: #98f5ff;">Unit</span>

<span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">Predicate&lt;T&gt;</span> = (<span style="color: #98f5ff;">T</span>) -&gt; <span style="color: #98f5ff;">Boolean</span>
</pre>
</div>

<p>
可以为 <span class="underline">内部类</span> 和 <span class="underline">嵌套类</span> 创建新名称：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">A</span> {
    <span style="color: #00bfff; font-weight: bold;">inner</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Inner</span>
}
<span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">B</span> {
    <span style="color: #00bfff; font-weight: bold;">inner</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Inner</span>
}

<span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">AInner</span> = <span style="color: #98f5ff;">A.Inner</span>
<span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">BInner</span> = <span style="color: #98f5ff;">B.Inner</span>
</pre>
</div>

<p>
类型别名不会引入新类型。 它们等效于相应的底层类型
</p>

<pre class="example">
  在代码中添加 typealias Predicate&lt;T&gt; 并使用 Predicate&lt;Int&gt; 时，Kotlin 编译器总是把它扩展为 (Int) -&gt; Boolean 
</pre>

<p>
因此，当需要泛型函数类型时，可以传递该类型的变量，反之亦然：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">Predicate&lt;T&gt;</span> = (<span style="color: #98f5ff;">T</span>) -&gt; <span style="color: #98f5ff;">Boolean</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>(p: <span style="color: #98f5ff;">Predicate&lt;Int&gt;</span>) = p(42)

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">f</span>: (<span style="color: #98f5ff;">Int</span>) -&gt; <span style="color: #98f5ff;">Boolean</span> = { <span style="color: #00bfff; font-weight: bold;">it</span> &gt; 0 }
    println(foo(f)) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#36755;&#20986; "true"</span>

    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">p</span>: <span style="color: #98f5ff;">Predicate&lt;Int&gt;</span> = { <span style="color: #00bfff; font-weight: bold;">it</span> &gt; 0 }
    println(listOf(1, -2).filter(p)) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#36755;&#20986; "[1]"</span>
}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="inline_class.html">Next：内联类</a></td>
<td class="org-left"><a href="object.html">Previous：对象表达式</a></td>
<td class="org-left"><a href="oo.html">Home：面向对象</a></td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
